// JavaScript Document
$(document).ready(function () {
    $("#mask4").append('<div class="mask-box"><div class="page"><div class="point"><h2>欢迎登录安全生产保险网！请填写真实有效的企业信息，以方便办理业务。安全生产保险网承若不向第三方提供本注册信息</h2>' +
    '</div><div class="mask-close" id="mask-close4">X</div><div class="usernewPage"><h2 class="f18 fb">用户注册协议</h2><p>1.接受条款</p><p>注册成为安全生产保险网用户前，确实详细阅读本协议的所有内容，当用户点击“同意注册协议，提交注册”后，即视为同意本协议的所有条款并愿受其约束，成为注册用户。</p><p>安全生产保险网有权对本协议条款进行修改，修改后的协议一旦公布即有效代替原来的协议。用户可随时查阅最新协议。每次协议更新后，用户会在下一次登陆安全生产保险网时，得到“同意用户注册协议”的提示。用户应仔细阅读协议，当用户点击“登陆”后，即视为用户同意接受更新版协议 。如用户不同意更新版协议，可以停止接受安全生产保险网依据本协议提供的服务。</p><p>2.服务说明</p><p>安全生产保险网通过国际互联网向用户提供丰富的网上资源，包括各种信息工具、网上交流、投保服务、个性化内容等等（以下简称“本服务”）。除非另有其它明示规定，增强或强化目前本服务的任何新功能，包括所推出的新产品，均受到本服务条款之规范。您了解并同意，本服务依“现状”提供，对使用者通讯或个人化设定的时效、删除、传递错误、未予储存、或其他任何问题，安全生产保险网均不承担任何责任。为使用本服务，您必须能够自行进入国际互联网，并应自行支付相关服务费用。此外，您必须自行提供与国际联网连线所需之一切必要装备，包括计算机、数据机或其他存取装置。</p><p>安全生产保险网提供的资料仅供参考目的之用。从安全生产保险网获得的资讯以及相关意见不应被认为是引诱用户投保或支付。用户应该了解，您所获得的信息均不是强迫提供，这些信息在任何情况下都不是，也不应看作是对用户的投保咨询。</p><p>3.遵守法律</p><p>您同意遵守《中华人民共和国保密法》、《计算机信息系统国际联网保密管理规定》、《中华人民共和国计算机信息系统安全保护条例》、《计算机信息网络国际联网安全保护管理办法》、《中华人民共和国计算机信息网络国际联网管理暂行规定》及其实施办法等相关法律法规的所有规定，并对您以任何方式使用服务的任何行为及其结果承担全部责任。在任何情况下，如果安全生产保险网合理地认为您的行为，包括但不限于您的任何言论和其他行为违反或可能违反上述法律和法规的任何规定，安全生产保险网可在任何时候不经事先通知终止向您提供服务。</p> <p>4.您的注册义务</p><p>为了能使用本服务，您同意以下事项∶</p><p>(a)依本服务注册表之提示提供注册公司真实、正确、最新及完整的资料（以下简称“登记资料”）。</p><p>(b)维持更新“登记资料”，确保其真实、正确、最新及完整。若您提供任何错误、不实、过时或不完整的资料，并为安全生产保险网所确知；或者安全生产保险网有合理的理由怀疑前述资料为错误、不实、过时或不完整，安全生产保险网有权暂停或终止您的帐号，并拒绝您于现在和未来使用本服务之全部或部分。</p><p>(c)个人注册客户服务内容是否适合用户的未成年子女浏览或者使用，由用户加以判断并约束，如因相关服务内容不适合未成年人浏览、使用而导致任何影响或损失，本网站不承担任何责任。</p> <p>5.安全生产保险网隐私保护</p><p>您的“登记资料”以及其他特定资料均受到本网站隐私政策保护。</p> <p>6.用户帐号、密码及安全</p><p>维持密码及帐号的机密安全，是您的责任。利用该密码及帐号所进行的一切行动，您应负完全的责任。所衍生之任何损失或损害，本网站无法也不承担任何责任。您同意以下事项：</p> <p>(a)您的密码或帐号遭到未获授权的使用，或者其他任何安全问题发生时，您将立即通知安全生产保险网；</p> <p>(b)每次连线完毕，均应正常退出您的帐号使用。您未能依前述指示行事，则有可能得不到安全生产保险网在安全方面的保护。</p><p>7.用户行为</p><p>您了解的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息或其他资料（以下简称“内容”），无论通过公开张贴或私下传送，均为前述“内容”提供者之责任。简而言之，您经由本服务上载、张贴、发送电子邮件或传送之“内容”，完全是您而非安全生产保险网的责任。安全生产保险网无法控制经由本服务而张贴之“内容”，因此不保证前述“内容”之正确性、完整性或品质。您了解使用本服务时，可能会接触到令人不快、不适当、令人厌恶之“内容”。在任何情况下，安全生产保险网均不为任何“内容”负责，包含但不限于任何“内容”之任何错误或遗漏，以及经由本服务张贴、发送电子邮件或传送而衍生之任何损失或损害。但安全生产保险网有权删除任何前述内容并停止您使用本服务的全部或部分。</p><p>您同意不将本服务作以下使用∶</p><p>(a)上载、张贴、发送电子邮件或传送任何非法、有害、胁迫、滥用、骚扰、侵害、中伤、粗俗、猥亵、诽谤、侵害他人隐私、有害或种族歧视的或道德上令人不快的“内容”。</p><p>(b)冒充任何人或机构，包含但不限于安全生产保险网主管、论坛领袖、主持人，或以虚伪不实的方式陈述或谎称与任何人或机构之关联。</p><p>(c)伪造标题或以其他方式操控识别资料，以伪装通过本服务传送的任何“内容”之来源。</p><p>(d)将依据任何法律,合约或法定关系无权传送的任何“内容”加以上载、张贴、发送电子邮件或以其他方式传送。</p><p>(e)将侵害任何人的专利、商标、商业秘密、著作权或其他专属权利（以下简称“权利”）的“内容”加以上载、张贴、发送电子邮件或以其他方式传送。</p> <p>(f)将任何广告信函、促销资料、“垃圾邮件”、“连锁信件”、“直销”或其他任何形式的劝诱资料加以上载、张贴、发送电子邮件或以其他方式传送，专供前述目的使用的区域，不在此限。</p><p>(g)将设计目的在于干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之任何资料，加以上载、张贴、发送电子邮件或以其他方式传送。</p><p>(h)破坏正常的对话流程、造成屏幕快速移动，或使本服务其他使用者无法打字，或对其他使用者参加即时交流的能力产生负面影响。</p><p>(i)干扰或破坏本服务或与本服务相连线的服务器和网络，或不遵守本服务连线网络的规定、程序、政策或规范。</p><p>(j)故意或非故意违反任何相关当地、国家和国际法。</p><p>(k)“跟踪”或以其他方式骚扰他人。</p><p>(l)收集和储存其他使用者之个人资料，本企业体系内的除外。</p><p>您了解安全生产保险网未针对“内容”事先加以审查，但安全生产保险网及其指定人有权（但无义务）拒绝和删除通过本服务提供的任何“内容”。在不限制前述规定的前提下，安全生产保险网及其指定人有权将违反本服务条款和令人反感的任何“内容”加以移除。您使用任何“内容”时，同意必须自行加以评估，承担所有风险。</p><p>您了解并同意，安全生产保险网(依据法律的要求，或基于诚信为了以下目的或在合理必要范围内)认定必须将“内容”加以保存或揭露时，可以保存及揭露：(a)遵守法律程序，(b)执行本服务条款， (c)回应任何“内容”侵害第三人权利之主张，或(d)保护安全生产保险网、其使用者及公众之权利、财产或个人安全。您了解本服务之技术处理及传送，包含您的“内容”，可能(a)经由各个网路加以传送，且(b)为了符合及配合连线网路或装置之技术要求而进行改变。</p><p>8.在安全生产保险网张贴公共资料</p><p>(a)为适用本服务条款，“本服务公开使用区域”指一般公众可以使用的区域。</p><p>(b)您选择在“本服务”公开使用区域张贴的“内容”，或在本服务其他任何公开使用区域张贴包含照片或图形之内容，您即授予安全生产保险网全球性、免许可费及非独家的使用权，使安全生产保险网为展示、散布及推广张贴前述“内容”之特定目的若为照片或图形，则仅为张贴前述照片或图形于本服务之目的(若为照片或图形，则仅为张贴前述照片或图形于本服务之目的为上述之使用)，将前述“内容”在本服务复制、修改、出版。若您选择继续将前述“内容”放入本服务，则本使用权持续有效；若您将前述“内容”自本服务中删除，则本使用权于删除时终止。</p><p>你选择于本服务其他公开使用区域张贴的其他“内容”，即授予安全生产保险网免许可费、永久有效、不可撤销、非独家及可完全再授权之权利，可在全球，使用、复制、修改、发行、翻译、创造衍生性著作，并将前述“内容”（一部或全部）加以散发、表演及展示，及/或放入任何现有和未来开发出的形式、媒体和科技的其他著作物当中。</p><p>9.禁止转售服务</p><p>您同意对本服务任何部分或本服务之使用或获得，不进行复制、拷贝、出售、转售或作任何商业目的的使用。</p><p>10.关于使用及储存的一般措施</p><p>您承认安全生产保险网可以订定关于本服务的一般措施及限制。若安全生产保险网将本服务维持或传送之任何讯息及其他通讯和其他“内容”删除或未予储存，安全生产保险网毋须承担任何责任。您亦同意，安全生产保险网有权关闭长时间未使用的帐号。不论通知与否，安全生产保险网有权随时变更这些一般措施及限制。</p>' +
    '<p>11.服务修改和终止</p><p>安全生产保险网有权于任何时间暂时或永久修改或终止本服务（或其任何部分），无论其通知与否。安全生产保险网对您和任何第三人均不承担关于本服务任何修改、暂停或终止之责任。</p><p>您同意安全生产保险网可以因任何理由终止您的密码、帐号（或其任何部分）或本服务之使用，并将您在本服务内任何“内容”加以移除并删除。安全生产保险网也可以于通知或未通知之情形下，随时终止本服务或其任何部分。您同意依本服务条款任何规定提供之本服务，无需进行事先通知即得终止，安全生产保险网可以立即关闭或删除您的帐号及您帐号中所有相关资料及档案，及/或禁止前述档案和本服务之使用。此外，您同意若本服务之使用被终止，安全生产保险网对您或任何第三人均不承担责任。</p><p>12.与广告商进行之交易</p><p>您于本服务或通过本服务与广告商进行通讯或商业往来，或参与促销活动，包含相关商品或服务之付款及交付，以及前述交易其他任何相关条款、条件、保证或声明，完全为您与前述广告商之间之行为。安全生产保险网依其注册地法或本服务条款，毋须承担对广告及广告商进行审查、甄别之义务。前述任何交易或前述广告商出现于本服务所产生的任何性质的损失或损害，安全生产保险网不予负责。</p> <p>13.链接</p><p>本服务或第三人可提供与其他国际联网上之网站或资源之链接。由于安全生产保险网无法控制前述网站及资源，您了解并同意，前述网站或资源是否可供利用，安全生产保险网不予负责，存在或源于前开网站或资源之任何“内容”、广告、产品或其他资料，安全生产保险网亦不予担保或负责。您进一步同意，因使用或依赖或经由前述任何网站或资源之任何“内容”、商品或服务所产生或据称所产生之任何损害或损失，安全生产保险网不承担任何直接或间接责任。</p><p>14.安全生产保险网之专属权利</p><p>您了解并同意，本服务及所使用之任何相关必要软件（以下简称“软件”）含有受到相关知识产权及其他法律保护之专有的保密资料。通过本服务或广告商向您呈现之赞助广告或资讯所包含之“内容”，均受到著作权、商标、服务商标、专利或其他专属权利及法律之保护。未经安全生产保险网或广告商明示授权，您同意不修改、出租、出借、出售、散布本服务或“软件”之部分或全部，或据以制作衍生著作。安全生产保险网授予您个人、不可移转及非专属之使用权，使您得于单机计算机使用其“软件”之目的，您不得（并不得允许任何第三人）复制、修改、创作衍生著作、进行还原工程、反向编译，或以其他方式发现源代码，或出售、转让、再授权或提供“软件”设定担保，或以其他方式移转“软件”之任何权利。您同意不以任何方式修改“软件”，或使用修改后的“软件”。您同意不经由非安全生产保险网所提供的界面使用本服务。</p><p>安全生产保险网商标、图案以及其他安全生产保险网标志及产品、服务名称，均为安全生产保险网公司之商标。未经安全生产保险网事先之同意，您同意不以任何方式展示或使用。</p><p>15.免责声明</p><p>您明确了解并同意：</p><p>（a）您使用本服务之风险由您个人负担。安全生产保险网依据“现况”及“现有”基础提供服务。安全生产保险网明确不提供任何明示或默示的担保。</p> <p>（b）安全生产保险网不保证以下事项：(Ⅰ)本服务将符合您的要求，(Ⅱ)本服务不受干扰、及时提供、安全可靠或免于出错，(Ⅲ)本服务之使用权取得的结果正确或可靠，(Ⅳ)您经由本服务购买或取得的任何产品、服务、资讯或其他资料将符合您的期望，且(Ⅴ)“软件”中任何错误都将得到更正。</p><p>（c）是否通过使用本服务下载或取得任何资料应由您自行考虑且自负风险，因任何资料之下载而导致您电脑系统之任何损坏或资料流失，您应负完全责任。</p> <p>（d）您自安全生产保险网或经由本服务取得之建议和资讯，无论其为书面或口头，绝不包含附带或以任何方式构成本服务条款未明示规定之任何保证。</p><p>（e）保单生效日期如因非可控因素导致不能正常生效，请及时拨打安全生产保险网客户服务电话400-616-8833。“非可控因素”包含但不限于互联网故障、停电、网络入侵、硬件故障等。</p><p>（f）安全生产保险网所提供的所有信息据、建议、分析等资料仅供参考，您据此操作而造成所有损失，安全生产保险网将不承担任何责任。</p><p>（g）安全生产保险网的帮助信息仅供您操作参考，据此操作而引起的纷争，安全生产保险网概不负责。</p><p>（h）安全生产保险网不保证提供的信息与数据等资料的及时性、条理性、准确性、充分性、完整性，不对上述信息与数据可能出现的错误或误导承担任何责任。</p><p>（i）安全生产保险网对进行投保与支付操作时在互联网传输过程中可能出现的系统中断、停顿、延迟、数据错误等情况不承担任何责任。</p><p>（j）非因我方原因或者由于不可抗力、不可预见等因素导致您不能正常使用本服务或及时地获得本服务所造成的损失，本网站和本网站的信息服务提供商不承担任何责任。</p><p>16.责任限制</p><p>您明确了解并同意，基于以下原因而造成之利润、商誉、使用、资料损失或其他无形损失，安全生产保险网不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿（即使安全生产保险网已被告知前述赔偿之可能性亦然）：（Ⅰ）本服务之使用或无法使用，（Ⅱ）经由或通过本服务购买或取得之任何商品、资料、资讯或服务，或接收之讯息，或进行的交易所衍生之替代商品及服务的购买成本，（Ⅲ）您的传输或资料遭到未获授权的存取或变造，（Ⅳ）本服务中任何第三人的声明或行为，或（Ⅴ）本服务其他相关事宜。</p><p>由于您通过本服务提供、张贴或传送的“内容”、您与本服务连线、您违反本服务条款、或您侵害其他人任何权利因而衍生或导致任何第三人提出的索赔或请求(包括合理的律师费)，您同意赔偿安全生产保险网及其分公司、关联公司、主管、代理人、联名厂商或其他夥伴及员工，并使其免受损害。</p> <p>17.保险相关服务之特别警告</p><p>若您希望就网站商情、投保、客户服务成立或加入任何服务，或从本服务接收或要求提供任何消息、信息、警告或其他资料，请再度详阅前述第14、15条。这两条对您加倍适用。本服务纳入的“内容”非供交易或投资目的而使用。经由本服务传送之任何资讯之正确性、适用性和供应，安全生产保险网均不予保证，并且不承担任何责任。基于前述资料之任何交易或投资决定，由您自行承担全部后果和责任。</p> <p>在此郑重提醒用户，网上投保仍然存在且不限于以下风险，用户还应充分了解和认识到其存在且不限于以下风险：</p> <p>（a）由于互联网和移动通讯网络数据传输等原因，投保和支付过程可能会出现中断、停顿、延迟、数据错误等情况；</p><p>（b）用户账号及密码信息泄露或客户身份可能被仿冒；</p><p>（c）由于互联网和移动通讯网络上存在黑客恶意攻击的可能性，网络服务器可能会出现故障及其他不可预测的因素，投保或支付过程可能会出现错误或延迟；</p><p>（d）用户的网络终端设备及软件系统可能会受到非法攻击或病毒感染，导致无法进行投保、支付或相关操作失败；</p><p>（e）用户的网络终端设备及软件系统与安全生产保险网所提供的系统不兼容，无法进行相关操作；</p><p>（f）如用户缺乏网上操作经验，可能因操作不当造成操作失败或操作失误；</p><p>（g）由于网络故障，用户通过本服务进行投保时，用户网络终端设备已显示操作成功，而我方服务器未接到其指令，从而存在投保不成功的风险；用户网络终端设备对其委托未显示成功，于是用户再次发出指令，而我网站已收到用户两次投保指令，并按其指令进行了操作，使投资者由此产生重复投保或支付的风险。</p><p>（h）上述风险可能会导致用户发生损失。</p><p>18.著作权和商标</p><p>安全生产保险网尊重他人知识财产，呼吁使用者也要同样尊重知识产权。若您认为您的作品遭到复制之情形已构成著作权之侵害，请提供以下资料予安全生产保险网：</p><p>(a)有权代理著作权利益所有人之电子或实体签名。</p><p>(b)您主张遭到侵害之作品描述。</p><p>(c)您主张遭侵害您权利之作品位于网站所在位置的叙述。</p><p>(d)地址、电话号码及电子邮件地址。</p><p>(e)于诚信认为该有争议的使用未经著作权人、其代理人或法律授权的声明。</p><p>(f)解做伪证之处罚前提下，声明您通知所载之前资述料均为正确，且您是著作权人或经授权代理著作权人为上述声明。</p> <p>关于著作权侵害主张通知，请拨打安全生产保险网客户服务电话400-616-8833或发送邮件至chinasafetyins@jiangtai.com。</p> <p>19.违约</p><p>倘发现任何违反本服务条款之事项，请拨打安全生产保险网客户服务电话400-616-8833或发送邮件至chinasafetyins@jiangtai.com。</p><p>20.用户中止条款</p><p>安全生产保险网保留在任何时候中止任何用户成员资格的权利。</p><p>21.一般条款</p>' +
    '<p>本服务条款构成您与安全生产保险网之全部协议，规范您对于本服务之使用，并取代您先前与安全生产保险网所签署之任何协议。您使用相关服务、第三方内容或软件时，亦应符合适用之额外条款及条件。本服务条款及您与安全生产保险网之关系，均受到中国法律所管辖，不适用其涉外法律原则。您与安全生产保险网均同意接受其个人及专属管辖。安全生产保险网未行使或执行本服务条款任何权利或规定，不构成前述权利或权利之抛弃。倘本服务条款任何规定经管辖法院认定无效，当事人依然同意法院应努力使前述规定反映之当事人意向具备效力，且本服务条款其它规定仍应保有完整的效力及效果。本服务条款之标题仅供方便而设，不具任何法律或契约效果。</p><p>本协议受中华人民共和国有关法律法规的约束。</p></div></div></div>')

    $("#mask3").append('<div class="mask-box f16"><div class="page" ><div class="point"><h2>欢迎登录安全生产保险网！请填写真实有效的企业信息，以方便办理业务。安全生产保险网承诺不向第三方提供本注册信息。</h2> </div><div class="mask-close" id="mask-close3">X</div><div class="newPage"><div class="progress"><p class="bto"> <span><b>1</b> 选择注册险种及用户类型</span><span><b>2</b> 填写注册企业信息</span><span class="active"><b class="active">√</b> 注册成功</span></p><p class="top"><span></span><span></span><span class="active"></span></p></div><div class="user_types"><input type="hidden" class="type_sub" name="type"><div class="sub01"><a class="finish">完成</a></div></div></div></div></div>')

    $("#mask-close1").click(function() {
        $("#mask1").hide();
    })
    $("#mask-close2").click(function() {
        $("#mask2").hide();
    })
    $("#mask-close3").click(function() {
        $("#mask3").hide();
    })
    $("#mask-close4").click(function() {
        $("#mask4").hide();
    })
    $("#resets").click(function(){
        $("#mask2").hide();
    });
    $(".finish").click(function() {
        $("#mask3").hide();
    })
});
//console.log($("#next1"));
$(".buttonShow").click(function(){
    $("#mask1").show();
    return false
});


//$(".register").click(function(){
//    $("#mask1").show();
//    return false
//});

function hideMask1(){
    $("#mask1").hide();
    $("#mask2").show();
}
function hideMask2(){
    $("#mask1").hide();
    $("#mask4").show();
}
function hideMask3(){
    $("#mask2").hide();
    $("#mask3").show();
}

$(function () {
    var a = $(".data-mobile"), t = $(".data-email"), s = $("ul.ul01 li:eq(0) span"), i = $("ul.ul01 li:eq(1) span"), l = $("ul.ul01 li:eq(0) i"), e = $("ul.ul01 li:eq(1) i"), c = $(".sub01 a"), u = /^1[3-9][0-9]\d{8}$/, v = /^[\w\-]+@[0-9a-z\-]+(\.[a-z]{2,4}){1,2}$/;
    a.blur(function () {
        "" != $(this).val() && (u.test(a.val()) || s.show())
    }), t.blur(function () {
        "" != $(this).val() && (v.test(t.val()) || i.show())
    }), a.focus(function () {
        s.hide(), i.hide(), e.removeClass("active"), l.addClass("active")
    }), t.focus(function () {
        s.hide(), i.hide(), l.removeClass("active"), e.addClass("active")
    }), l.click(function () {
        e.removeClass("active"), l.addClass("active")
    }), e.click(function () {
        l.removeClass("active"), e.addClass("active")
    }), c.click(function () {
        e.hasClass("active") ? v.test(t.val()) ? ($(".type_sub").val(t.attr("data-type")), $(".form1").submit()) : i.show() : l.hasClass("active") && (u.test(a.val()) ? ($(".type_sub").val(a.attr("data-type")), $(".form1").submit()) : s.show())
    })
});







